app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "abc@gmail.com"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ej5fhlPga5SYxIGPKLTNtw"], ["updated_at", "2021-02-09 22:51:46.476529"], ["id", 3]]
---
  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!